Revit 2027 API
ExportLinetypeTable.Remove Method
 Removes the pair (key, info) corresponding to the given ExportLinetypeKey.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void Remove(
	ExportLinetypeKey exportLinetypeKey
)
Public Sub Remove (
	exportLinetypeKey As ExportLinetypeKey
)
public:
void Remove(
	ExportLinetypeKey^ exportLinetypeKey
)
member Remove :
        exportLinetypeKey : ExportLinetypeKey -> unit
Parameters
exportLinetypeKey ExportLinetypeKey
 The export line type key
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ExportLinetypeTable Class
Autodesk.Revit.DB Namespace